use caldb;

-- ※실행시 테이블의 모든 데이터가 지워짐! -- 
truncate vote;

INSERT INTO vote
VALUES(1, "sung", "KY313", "동아시아", "일반 교양", "투표중","2020-05-18 09:30:00.000000", "2020-05-18 10:30:00.000000", 50, 40, 90);
INSERT INTO vote
VALUES(2, "sung", "KY311", "120년전쟁과", "일반 교양", "투표중","2020-05-18 09:30:00.000000", "2020-05-18 10:30:00.000000", 90, 0, 90);
INSERT INTO vote
VALUES(3, "sung", "KY310", "한반도의 평화", "일반 교양", "투표중", "2020-05-18 09:30:00.000000", "2020-05-18 10:30:00.000000",10, 80, 90);
INSERT INTO vote
VALUES(4, "sung", "KY309", "정조문화", "일반 교양", "투표중", "2020-05-18 09:30:00.000000", "2020-05-18 10:30:00.000000",20, 40, 90);
INSERT INTO vote
VALUES(5, "sung", "KY300", "언어와 문화", "일반 교양", "투표중", "2020-05-18 09:30:00.000000", "2020-05-18 10:30:00.000000",30, 40, 90);
INSERT INTO vote
VALUES(6, "sung", "KY301", "문화산업", "일반 교양", "투표중", "2020-05-18 09:30:00.000000", "2020-05-18 10:30:00.000000",20, 40, 90);
INSERT INTO vote
VALUES(7, "sung", "KY302", "노동의 의미", "일반 교양", "투표중", "2020-05-18 09:30:00.000000", "2020-05-18 10:30:00.000000",10, 40, 90);
INSERT INTO vote
VALUES(8, "sung", "KY303", "자료구조", "전공 필수", "투표중", "2020-05-18 09:30:00.000000", "2020-05-18 10:30:00.000000",60, 10, 90);
INSERT INTO vote
VALUES(9, "sung", "KY304", "미디어와 사회", "일반 교양", "투표중", "2020-05-18 09:30:00.000000", "2020-05-18 10:30:00.000000",88, 2, 90);
